plotMachineIOPS_LATENCY/fio_output/randread-32jobs-512files-512k.fio_tmpfs.out
jobs1: (g=0): rw=randread, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 32 processes
jobs1: Laying out IO files (512 files / total 30720MiB)

jobs1: (groupid=0, jobs=32): err= 0: pid=1154303: Wed Jul 26 08:45:23 2023
  read: IOPS=9079, BW=4540MiB/s (4760MB/s)(30.0GiB/6767msec)
    slat (usec): min=93, max=740, avg=109.06, stdev=20.53
    clat (usec): min=2, max=51720, avg=13925.03, stdev=2031.92
     lat (usec): min=103, max=52450, avg=14034.22, stdev=2050.52
    clat percentiles (usec):
     |  1.00th=[13042],  5.00th=[13042], 10.00th=[13042], 20.00th=[13042],
     | 30.00th=[13042], 40.00th=[13042], 50.00th=[13042], 60.00th=[13173],
     | 70.00th=[13304], 80.00th=[13435], 90.00th=[17957], 95.00th=[17957],
     | 99.00th=[18482], 99.50th=[18482], 99.90th=[29754], 99.95th=[38011],
     | 99.99th=[48497]
   bw (  MiB/s): min= 3258, max= 4844, per=100.00%, avg=4561.22, stdev=559.55, samples=13
   iops        : min= 6517, max= 9688, avg=9122.31, stdev=1119.28, samples=13
  lat (usec)   : 4=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.02%, 4=0.03%, 10=0.10%, 20=99.65%, 50=0.19%
  lat (msec)   : 100=0.01%
  cpu          : usr=1.02%, sys=98.98%, ctx=15, majf=1, minf=16490
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=61440,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
   READ: bw=4540MiB/s (4760MB/s), 4540MiB/s-4540MiB/s (4760MB/s-4760MB/s), io=30.0GiB (32.2GB), run=6767-6767msec