plotMachineIOPS_LATENCY/fio_output/randwrite-16jobs-1024files-512k.fio_fuse_boc.out
jobs1: (g=0): rw=randwrite, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (1024 files / total 30720MiB)
fio: pid=1194492, err=24/file:filesetup.c:805, func=open(/home/sevag/fuse_boc//f1018), error=Too many open files

jobs1: (groupid=0, jobs=16): err=24 (file:filesetup.c:805, func=open(/home/sevag/fuse_boc//f1018), error=Too many open files): pid=1194492: Wed Jul 26 10:40:00 2023
  write: IOPS=773, BW=387MiB/s (405MB/s)(510MiB/1318msec); 0 zone resets
    slat (usec): min=282, max=575338, avg=1174.89, stdev=18060.01
    clat (usec): min=75, max=136605, avg=87342.89, stdev=30715.06
     lat (usec): min=443, max=643499, avg=88518.22, stdev=35390.20
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   30], 10.00th=[   44], 20.00th=[   55],
     | 30.00th=[   82], 40.00th=[   90], 50.00th=[   94], 60.00th=[   99],
     | 70.00th=[  103], 80.00th=[  110], 90.00th=[  128], 95.00th=[  133],
     | 99.00th=[  136], 99.50th=[  138], 99.90th=[  138], 99.95th=[  138],
     | 99.99th=[  138]
   bw (  KiB/s): min=43311, max=634880, per=85.66%, avg=339095.50, stdev=418302.45, samples=2
   iops        : min=   84, max= 1240, avg=662.00, stdev=817.42, samples=2
  lat (usec)   : 100=0.10%, 750=0.10%
  lat (msec)   : 2=0.29%, 4=0.39%, 10=0.98%, 20=1.67%, 50=12.86%
  lat (msec)   : 100=50.64%, 250=32.97%
  cpu          : usr=2.05%, sys=32.57%, ctx=1097, majf=0, minf=52
  IO depths    : 1=0.1%, 2=0.2%, 4=0.4%, 8=0.8%, 16=1.6%, 32=3.1%, >=64=93.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=99.9%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,1019,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=387MiB/s (405MB/s), 387MiB/s-387MiB/s (405MB/s-405MB/s), io=510MiB (534MB), run=1318-1318msec