plotMachineIOPS_LATENCY/fio_output/randwrite-16jobs-1files-32k.fio_fuse_ext4.out
jobs1: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO file (1 file / 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=165074: Tue Jul 25 18:44:33 2023
  write: IOPS=58.3k, BW=1823MiB/s (1911MB/s)(30.0GiB/16853msec); 0 zone resets
    slat (usec): min=8, max=135900, avg=16.50, stdev=210.68
    clat (nsec): min=1892, max=581115k, avg=2107107.65, stdev=1711756.63
     lat (usec): min=22, max=581187, avg=2123.68, stdev=1811.20
    clat percentiles (usec):
     |  1.00th=[ 1270],  5.00th=[ 1500], 10.00th=[ 1909], 20.00th=[ 1926],
     | 30.00th=[ 1942], 40.00th=[ 1958], 50.00th=[ 1975], 60.00th=[ 2008],
     | 70.00th=[ 2040], 80.00th=[ 2089], 90.00th=[ 2311], 95.00th=[ 2573],
     | 99.00th=[ 3490], 99.50th=[11469], 99.90th=[17171], 99.95th=[18744],
     | 99.99th=[21103]
   bw (  MiB/s): min= 1257, max= 2008, per=100.00%, avg=1888.09, stdev=182.22, samples=32
   iops        : min=40238, max=64260, avg=60419.00, stdev=5831.12, samples=32
  lat (usec)   : 2=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=59.04%, 4=40.23%, 10=0.03%, 20=0.66%, 50=0.03%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=6.72%, sys=86.17%, ctx=111, majf=0, minf=41
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,983040,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=1823MiB/s (1911MB/s), 1823MiB/s-1823MiB/s (1911MB/s-1911MB/s), io=30.0GiB (32.2GB), run=16853-16853msec