plotMachineIOPS_LATENCY/fio_output/randwrite-16jobs-1files-4k.fio_tmpfs.out
jobs1: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO file (1 file / 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=109239: Tue Jul 25 17:44:05 2023
  write: IOPS=533k, BW=2082MiB/s (2183MB/s)(30.0GiB/14757msec); 0 zone resets
    slat (nsec): min=856, max=30518, avg=1362.73, stdev=291.83
    clat (nsec): min=948, max=826071, avg=238521.61, stdev=39713.59
     lat (usec): min=2, max=830, avg=239.93, stdev=39.96
    clat percentiles (usec):
     |  1.00th=[  219],  5.00th=[  225], 10.00th=[  227], 20.00th=[  227],
     | 30.00th=[  227], 40.00th=[  229], 50.00th=[  229], 60.00th=[  229],
     | 70.00th=[  231], 80.00th=[  231], 90.00th=[  233], 95.00th=[  383],
     | 99.00th=[  392], 99.50th=[  396], 99.90th=[  404], 99.95th=[  570],
     | 99.99th=[  766]
   bw (  MiB/s): min= 1265, max= 2231, per=100.00%, avg=2090.18, stdev=257.19, samples=29
   iops        : min=323863, max=571308, avg=535085.90, stdev=65841.99, samples=29
  lat (nsec)   : 1000=0.01%
  lat (usec)   : 4=0.01%, 10=0.01%, 20=0.01%, 50=0.01%, 100=0.01%
  lat (usec)   : 250=93.22%, 500=6.73%, 750=0.03%, 1000=0.02%
  cpu          : usr=24.80%, sys=75.20%, ctx=14, majf=0, minf=34
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,7864320,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=2082MiB/s (2183MB/s), 2082MiB/s-2082MiB/s (2183MB/s-2183MB/s), io=30.0GiB (32.2GB), run=14757-14757msec