plotMachineIOPS_LATENCY/fio_output/randwrite-16jobs-64files-128k.fio_ramdisk.out
jobs1: (g=0): rw=randwrite, bs=(R) 128KiB-128KiB, (W) 128KiB-128KiB, (T) 128KiB-128KiB, ioengine=libaio, iodepth=128
...
fio-3.28
Starting 16 processes
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=16): err= 0: pid=497178: Tue Jul 25 23:08:00 2023
  write: IOPS=27.4k, BW=3427MiB/s (3594MB/s)(30.0GiB/8964msec); 0 zone resets
    slat (usec): min=27, max=897, avg=35.79, stdev=10.00
    clat (usec): min=2, max=14233, avg=4627.43, stdev=1224.08
     lat (usec): min=31, max=14343, avg=4663.30, stdev=1233.66
    clat percentiles (usec):
     |  1.00th=[ 4047],  5.00th=[ 4047], 10.00th=[ 4047], 20.00th=[ 4080],
     | 30.00th=[ 4080], 40.00th=[ 4080], 50.00th=[ 4080], 60.00th=[ 4080],
     | 70.00th=[ 4080], 80.00th=[ 4113], 90.00th=[ 7308], 95.00th=[ 7308],
     | 99.00th=[ 7373], 99.50th=[ 7439], 99.90th=[ 7832], 99.95th=[ 8586],
     | 99.99th=[10290]
   bw (  MiB/s): min= 2101, max= 3903, per=99.83%, avg=3421.36, stdev=775.90, samples=17
   iops        : min=16812, max=31230, avg=27370.82, stdev=6207.28, samples=17
  lat (usec)   : 4=0.01%, 50=0.01%, 100=0.01%, 250=0.01%, 500=0.01%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.03%, 10=99.94%, 20=0.01%
  cpu          : usr=8.30%, sys=91.69%, ctx=27, majf=0, minf=51
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,245760,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=3427MiB/s (3594MB/s), 3427MiB/s-3427MiB/s (3594MB/s-3594MB/s), io=30.0GiB (32.2GB), run=8964-8964msec