plotMachineIOPS_LATENCY/fio_output/randwrite-1jobs-64files-32k.fio_fuse_ext4.out
jobs1: (g=0): rw=randwrite, bs=(R) 32.0KiB-32.0KiB, (W) 32.0KiB-32.0KiB, (T) 32.0KiB-32.0KiB, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=1): err= 0: pid=470530: Tue Jul 25 22:10:34 2023
  write: IOPS=65.1k, BW=2033MiB/s (2132MB/s)(30.0GiB/15107msec); 0 zone resets
    slat (usec): min=8, max=132641, avg=14.59, stdev=227.10
    clat (nsec): min=1487, max=335519k, avg=1911950.69, stdev=2005692.47
     lat (usec): min=12, max=335599, avg=1926.62, stdev=2040.10
    clat percentiles (usec):
     |  1.00th=[ 1352],  5.00th=[ 1352], 10.00th=[ 1369], 20.00th=[ 1385],
     | 30.00th=[ 1401], 40.00th=[ 1434], 50.00th=[ 1467], 60.00th=[ 1516],
     | 70.00th=[ 1614], 80.00th=[ 1762], 90.00th=[ 2442], 95.00th=[ 2606],
     | 99.00th=[12911], 99.50th=[13566], 99.90th=[19006], 99.95th=[19792],
     | 99.99th=[21890]
   bw (  MiB/s): min=  477, max= 2336, per=100.00%, avg=2034.75, stdev=401.43, samples=30
   iops        : min=15284, max=74782, avg=65112.13, stdev=12845.77, samples=30
  lat (usec)   : 2=0.01%, 20=0.01%, 50=0.01%, 100=0.01%, 250=0.01%
  lat (usec)   : 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=86.55%, 4=10.65%, 10=0.25%, 20=2.51%, 50=0.04%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%
  cpu          : usr=7.14%, sys=75.09%, ctx=1264, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,983040,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=2033MiB/s (2132MB/s), 2033MiB/s-2033MiB/s (2132MB/s-2132MB/s), io=30.0GiB (32.2GB), run=15107-15107msec