plotMachineIOPS_LATENCY/fio_output/randwrite-1jobs-64files-512k.fio_ramdisk.out
jobs1: (g=0): rw=randwrite, bs=(R) 512KiB-512KiB, (W) 512KiB-512KiB, (T) 512KiB-512KiB, ioengine=libaio, iodepth=128
fio-3.28
Starting 1 process
jobs1: Laying out IO files (64 files / total 30720MiB)

jobs1: (groupid=0, jobs=1): err= 0: pid=515408: Tue Jul 25 23:53:54 2023
  write: IOPS=5758, BW=2879MiB/s (3019MB/s)(30.0GiB/10670msec); 0 zone resets
    slat (usec): min=141, max=300, avg=172.38, stdev=39.31
    clat (usec): min=2, max=35192, avg=22017.93, stdev=5017.28
     lat (usec): min=156, max=35468, avg=22190.46, stdev=5056.04
    clat percentiles (usec):
     |  1.00th=[19792],  5.00th=[19792], 10.00th=[20055], 20.00th=[20055],
     | 30.00th=[20055], 40.00th=[20055], 50.00th=[20055], 60.00th=[20055],
     | 70.00th=[20055], 80.00th=[20055], 90.00th=[34341], 95.00th=[34341],
     | 99.00th=[34341], 99.50th=[34866], 99.90th=[34866], 99.95th=[34866],
     | 99.99th=[35390]
   bw (  MiB/s): min= 1709, max= 3179, per=99.68%, avg=2869.76, stdev=567.27, samples=21
   iops        : min= 3418, max= 6358, avg=5739.52, stdev=1134.54, samples=21
  lat (usec)   : 4=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.02%, 10=0.06%, 20=43.16%, 50=56.73%
  cpu          : usr=10.51%, sys=89.51%, ctx=16, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=0,61440,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: bw=2879MiB/s (3019MB/s), 2879MiB/s-2879MiB/s (3019MB/s-3019MB/s), io=30.0GiB (32.2GB), run=10670-10670msec